0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
108
109
110
111
112
113
114
115
116
117
118
119
120
121
122
123
124
125
126
127
128
129
130
131
132
133
134
135
136
137
138
139
140
142
143
144
147
149
76ers
Aaron
Aaron_Brooks
Aaron_Gordon
Abrines
Acy
Adams
Afflalo
Ajinca
Al
Al-Farouq_Aminu
Al_Horford
Al_Jefferson
Alan_Anderson
Alan_Williams
Aldrich
Aldridge
Alec
Alec_Burks
Alex
Alex_Abrines
Alex_Len
Alex_Stepheson
Alexey_Shved
Alexis
Alexis_Ajinca
Allen
Allen_Crabbe
Alonzo_Gee
Amar'e_Stoudemire
Aminu
Amir
Amir_Johnson
Andersen
Anderson
Anderson_Varejao
Andre
Andre_Drummond
Andre_Iguodala
Andre_Miller
Andre_Roberson
Andrea_Bargnani
Andrew
Andrew_Bogut
Andrew_Harrison
Andrew_Nicholson
Andrew_Wiggins
Antetokounmpo
Anthony
Anthony_Bennett
Anthony_Davis
Anthony_Morrow
Anthony_Tolliver
Antonio
Archie_Goodwin
Ariza
Aron_Baynes
Arron
Arron_Afflalo
Arthur
Asik
Atlanta
Atlanta_Hawks
Augustin
Austin_Daye
Austin_Rivers
Avery_Bradley
Ayres
Babbitt
Barbosa
Barea
Bargnani
Barnes
Barton
Bass
Batum
Bayless
Baynes
Bazemore
Beal
Beasley
Belinelli
Bembry
Ben
Ben_Gordon
Ben_McLemore
Bennett
Beno_Udrih
Beverley
Bismack_Biyombo
Biyombo
Bjelica
Blair
Blake_Griffin
Blazers
Bledsoe
Boban_Marjanovic
Bobby_Portis
Bogdanovic
Bogut
Bojan
Bojan_Bogdanovic
Bonner
Booker
Boozer
Boris_Diaw
Bosh
Boston
Boston_Celtics
Bradley
Bradley_Beal
Brandan_Wright
Brandon_Bass
Brandon_Davies
Brandon_Ingram
Brandon_Jennings
Brandon_Knight
Brandon_Rush
Brewer
Brian
Brian_Roberts
Brogdon
Brook
Brook_Lopez
Brooklyn
Brooklyn_Nets
Brooks
Brown
Bruno_Caboclo
Bryant
Bryce_Cotton
Bucks
Buddy
Buddy_Hield
Budinger
Bulls
Burke
Burks
Butler
CJ_McCollum
CJ_Miles
Calathes
Calderon
Caldwell-Pope
Cameron_Payne
Canaan
Capela
Caris
Caris_LeVert
Carl_Landry
Carlos_Boozer
Carmelo
Carmelo_Anthony
Caron_Butler
Carroll
Carter
Carter-Williams
Casspi
Cauley-Stein
Cavaliers
Celtics
Chalmers
Chandler
Chandler_Parsons
Channing_Frye
Charlie
Charlie_Villanueva
Charlotte
Charlotte_Hornets
Chase_Budinger
Chasson_Randle
Cheick_Diallo
Chicago
Chicago_Bulls
Chris
Chris_Andersen
Chris_Bosh
Chris_Copeland
Chris_Johnson
Chris_Kaman
Chris_Paul
Chriss
Christmas
City
Clark
Clarkson
Cleanthony_Early
Cleveland
Cleveland_Cavaliers
Clint
Clint_Capela
Clippers
Cody_Zeller
Cole
Cole_Aldrich
Collison
Conley
Copeland
Corey
Corey_Brewer
Cory_Jefferson
Cory_Joseph
Courtney_Lee
Cousins
Covington
Crabbe
Crawford
Cristiano_Felicio
Crowder
Cunningham
Curry
D'Angelo_Russell
Dahntay_Jones
Dallas
Dallas_Mavericks
Damian_Lillard
Damien_Inglis
Damjan_Rudez
Daniels
Danilo
Danilo_Gallinari
Danny_Granger
Danny_Green
Dante_Cunningham
Dante_Exum
Dario_Saric
Darius_Miller
Darrell_Arthur
Darren_Collison
Darrun
Darrun_Hilliard
Datome
David
David_Lee
David_West
Davis
Davis_Bertans
DeAndre_Jordan
DeAndre_Liggins
DeJuan_Blair
DeMar
DeMar_DeRozan
DeMarcus
DeMarcus_Cousins
DeMarre
DeMarre_Carroll
DeRozan
Dedmon
Dejounte_Murray
Dellavedova
Delon_Wright
Deng
Dennis
Dennis_Schroder
Denver
Denver_Nuggets
Denzel_Valentine
Deron_Williams
Derrick
Derrick_Favors
Derrick_Rose
Derrick_Williams
Detroit
Detroit_Pistons
Devin_Booker
Devin_Harris
Dewayne_Dedmon
Deyonta_Davis
Dieng
Dinwiddie
Dion
Dion_Waiters
Dirk
Dirk_Nowitzki
Domantas_Sabonis
Donald_Sloan
Donatas
Donatas_Motiejunas
Dorell_Wright
Dorian_Finney-Smith
Dorsey
Doug_McDermott
Douglas
Dragan_Bender
Dragic
Draymond_Green
Drew
Drew_Gooden
Drummond
Dudley
Duncan
Durant
Dwight
Dwight_Howard
Dwight_Powell
Dwyane_Wade
E'Twaun_Moore
Early
Ed_Davis
Eddie
Elfrid_Payton
Elijah_Millsap
Ellington
Ellis
Elton_Brand
Embiid
Emmanuel
Emmanuel_Mudiay
Enes
Enes_Kanter
Ennis
Eric_Bledsoe
Eric_Gordon
Ersan
Ersan_Ilyasova
Evan
Evan_Fournier
Evan_Turner
Evans
Faried
Favors
Felton
Ferrell
Festus_Ezeli
Fields
Fournier
Foye
Francisco_Garcia
Frank
Frank_Kaminsky
Frazier
Fred
Fred_VanVleet
Freeland
Frye
Furkan_Aldemir
Gallinari
Galloway
Garnett
Garrett_Temple
Gary_Harris
Gary_Neal
Gasol
Gay
Gee
George
George_Hill
Georgios_Papagiannis
Gerald_Green
Gerald_Henderson
Giannis
Giannis_Antetokounmpo
Gibson
Ginobili
Glen_Davis
Glenn_Robinson
Glenn_Robinson_III
Gobert
Golden
Golden_State
Golden_State_Warriors
Gooden
Goodwin
Goran
Goran_Dragic
Gordon
Gordon_Hayward
Gorgui
Gorgui_Dieng
Gortat
Granger
Grant
Green
Greg
Greg_Monroe
Greivis_Vasquez
Griffin
Grizzlies
Hairston
Hamilton
Hardaway
Harden
Harkless
Harrell
Harris
Harrison
Harrison_Barnes
Hassan_Whiteside
Hawes
Hawks
Hayward
Heat
Hedo
Henderson
Henry_Sims
Henry_Walker
Henson
Hernangomez
Hezonja
Hibbert
Hickson
Hield
Hill
Holiday
Hollins
Hollis-Jefferson
Hollis_Thompson
Holmes
Hood
Horford
Hornets
House
Houston
Houston_Rockets
Howard
Huertas
Humphries
Hunter
IV
Ian
Ian_Clark
Ian_Mahinmi
Ibaka
Iguodala
Ilyasova
Iman
Iman_Shumpert
Indiana
Indiana_Pacers
Ingles
Ingram
Irving
Isaiah_Canaan
Isaiah_Thomas
Isaiah_Whitehead
Ish_Smith
Ivica_Zubac
J.J.
J.J._Barea
JJ
JR
JaKarr_Sampson
JaMychal_Green
JaVale_McGee
Jabari
Jabari_Brown
Jabari_Parker
Jack
Jackson
Jae_Crowder
Jahlil
Jahlil_Okafor
Jake_Layman
Jakob
Jamal_Crawford
Jamal_Murray
Jameer_Nelson
James
James_Anderson
James_Harden
James_Johnson
James_Jones
James_Young
Jannero_Pargo
Jared
Jared_Dudley
Jared_Sullinger
Jarell_Martin
Jarrett_Jack
Jason
Jason_Richardson
Jason_Smith
Jason_Terry
Jason_Thompson
Jaylen_Brown
Jazz
Jeff
Jeff_Ayres
Jeff_Green
Jeff_Teague
Jeff_Withey
Jefferson
Jennings
Jerami_Grant
Jeremy_Evans
Jeremy_Lamb
Jeremy_Lin
Jerian_Grant
Jerome_Jordan
Jerryd_Bayless
Jimmer_Fredette
Jimmy_Butler
Joakim_Noah
Jodie_Meeks
Joe_Harris
Joe_Ingles
Joe_Johnson
Joe_Young
Joel
Joel_Anthony
Joel_Embiid
Joel_Freeland
Joey_Dorsey
Joffrey_Lauvergne
John
John_Henson
John_Jenkins
John_Wall
Johnny
Johnson
Jokic
Jon_Leuer
Jonas
Jonas_Jerebko
Jonas_Valanciunas
Jonathan
Jonathan_Gibson
Jonathon_Simmons
Jones
Jordan
Jordan_Adams
Jordan_Clarkson
Jordan_Crawford
Jordan_Farmar
Jordan_Hamilton
Jordan_Hill
Jordan_McRae
Jorge_Gutierrez
Jose
Jose_Calderon
Joseph
Josh
Josh_McRoberts
Josh_Richardson
Josh_Smith
Jrue_Holiday
Julius
Julius_Randle
Justin_Anderson
Justin_Hamilton
Justin_Holiday
Justise_Winslow
Jusuf_Nurkic
Kaman
Kaminsky
Kanter
Karl-Anthony_Towns
Kawhi_Leonard
Kay_Felder
Kelly
Kelly_Olynyk
Kemba
Kemba_Walker
Kendall_Marshall
Kendrick_Perkins
Kenneth_Faried
Kent
Kent_Bazemore
Kentavious
Kentavious_Caldwell-Pope
Kenyon_Martin
Kevin
Kevin_Durant
Kevin_Garnett
Kevin_Love
Kevin_Martin
Kevin_Seraphin
Kevon_Looney
Khris_Middleton
Kidd-Gilchrist
Kilpatrick
Kings
Kirk
Kirk_Hinrich
Klay
Klay_Thompson
Knicks
Knight
Kobe
Kobe_Bryant
Korver
Kosta_Koufos
Kostas_Papanikolaou
Koufos
Kris
Kris_Dunn
Kris_Humphries
Kristaps
Kristaps_Porzingis
Kuzminskas
Kyle_Anderson
Kyle_Korver
Kyle_Lowry
Kyle_O'Quinn
Kyle_Singler
Kyrie
Kyrie_Irving
LA
LaMarcus
LaMarcus_Aldridge
LaVine
Labissiere
Lakers
Lamb
Lance_Stephenson
Lance_Thomas
Landry
Landry_Fields
Langston_Galloway
Larry
Larry_Sanders
Lavoy_Allen
Lawson
Layman
LeBron
LeBron_James
Leandro_Barbosa
Lee
Len
Leonard
Leuer
Lillard
Lin
Livingston
Long
Lopez
Los
Los_Angeles
Los_Angeles_Clippers
Los_Angeles_Lakers
Lou
Lou_Amundson
Lou_Williams
Love
Lowry
Luc
Lucas
Lucas_Nogueira
Luis_Scola
Luke
Luke_Babbitt
Luol_Deng
Lyles
Mack
Magic
Mahinmi
Malachi_Richardson
Malcolm
Malcolm_Brogdon
Malcolm_Delaney
Manu
Manu_Ginobili
Marble
Marc_Gasol
Marcelo_Huertas
Marcin
Marcin_Gortat
Marco
Marco_Belinelli
Marcus
Marcus_Morris
Marcus_Smart
Marcus_Thornton
Mario
Mario_Chalmers
Mario_Hezonja
Marjanovic
Markel_Brown
Markieff
Markieff_Morris
Marquese
Marquese_Chriss
Marreese_Speights
Martin
Marvin_Williams
Mason_Plumlee
Matt_Barnes
Matt_Bonner
Matthew
Matthew_Dellavedova
Matthews
Maurice
Maurice_Harkless
Mavericks
Mayo
Mbah
McCallum
McCollum
McConnell
McDaniels
McDermott
McGary
McGee
McLemore
McRae
McRoberts
Meeks
Mejri
Memphis
Memphis_Grizzlies
Metta
Meyers_Leonard
Miami
Miami_Heat
Michael
Michael_Beasley
Michael_Carter-Williams
Michael_Kidd-Gilchrist
Middleton
Mike
Mike_Conley
Mike_Dunleavy
Mike_Miller
Mike_Muscala
Mike_Scott
Miles
Miles_Plumlee
Miller
Mills
Millsap
Milwaukee
Milwaukee_Bucks
Mindaugas_Kuzminskas
Minnesota
Minnesota_Timberwolves
Mirotic
Mirza_Teletovic
Mitch_McGary
Mo
Mo_Williams
Monroe
Monta
Monta_Ellis
Montrezl_Harrell
Moore
Morris
Morrow
Motiejunas
Moute
Mozgov
Mudiay
Muhammad
Muscala
Myles
Myles_Turner
Nance
Nate_Robinson
Nate_Wolters
Neal
Nelson
Nemanja_Bjelica
Nene
Nerlens_Noel
Nets
New
New_Orleans
New_Orleans_Pelicans
New_York
New_York_Knicks
Nicholson
Nick_Calathes
Nick_Collison
Nick_Young
Nicolas_Batum
Nicolas_Brussino
Nik
Nik_Stauskas
Nikola
Nikola_Jokic
Nikola_Mirotic
Nikola_Pekovic
Nikola_Vucevic
Noah
Noah_Vonleh
Noel
Norman_Powell
Norris_Cole
Nowitzki
Nuggets
Nurkic
O'Bryant
O'Quinn
Okafor
Okaro_White
Oklahoma
Oklahoma_City
Oklahoma_City_Thunder
Oladipo
Olynyk
Omer_Asik
Omri_Casspi
Orlando
Orlando_Magic
Otto_Porter
Otto_Porter_Jr.
Oubre
PJ_Hairston
Pacers
Pachulia
Parker
Parsons
Pascal_Siakam
Patrick
Patrick_Beverley
Patrick_McCaw
Patrick_Patterson
Patterson
Patty_Mills
Pau
Pau_Gasol
Paul
Paul_George
Paul_Millsap
Paul_Pierce
Paul_Zipser
Payne
Payton
Peace
Pekovic
Pelicans
Perkins
Pero_Antic
Perry
Phil_Pressey
Philadelphia
Philadelphia_76ers
Phoenix
Phoenix_Suns
Pierce
Pierre_Jackson
Pistons
Plumlee
Pondexter
Porter
Portland
Porzingis
Powell
Price
Prince
Quincy_Acy
Quincy_Miller
Quincy_Pondexter
Rajon
Rajon_Rondo
Rakeem_Christmas
Ramon_Sessions
Randle
Randolph
Randy
Randy_Foye
Raptors
Rashad_Vaughn
Rashard_Lewis
Rasual_Butler
Raul_Neto
Ray_McCallum
Raymond_Felton
Redick
Reed
Reggie
Reggie_Bullock
Reggie_Evans
Reggie_Jackson
Richard
Richard_Jefferson
Richardson
Richaun_Holmes
Ricky_Ledo
Ricky_Rubio
Rivers
Robbie_Hummel
Roberson
Robert
Robert_Covington
Robert_Sacre
Roberts
Robin_Lopez
Robinson
Rockets
Rodney
Rodney_Hood
Rodney_McGruder
Rodney_Stuckey
Rodriguez
Ron_Baker
Rondae
Rondae_Hollis-Jefferson
Rondo
Ronnie_Price
Rose
Ross
Roy
Roy_Hibbert
Rozier
Rubio
Rudez
Rudy
Rudy_Gay
Rudy_Gobert
Russell
Russell_Westbrook
Ryan
Ryan_Anderson
Ryan_Hollins
Ryan_Kelly
Sabonis
Sacramento
Sacramento_Kings
Salah_Mejri
Sam_Dekker
Sampson
Samuel_Dalembert
San
San_Antonio
San_Antonio_Spurs
Saric
Sasha_Vujacic
Schroder
Scola
Scott
Sean_Kilpatrick
Sebastian_Telfair
Sefolosha
Semaj_Christon
Serge_Ibaka
Sergey_Karasev
Sergio_Rodriguez
Sessions
Seth_Curry
Shabazz
Shabazz_Muhammad
Shabazz_Napier
Shane_Larkin
Shaun_Livingston
Shawn_Long
Shawn_Marion
Shawne_Williams
Sheldon_McClellan
Shelvin_Mack
Shumpert
Shved
Simmons
Singler
Skal_Labissiere
Sloan
Smart
Smith
Snell
Solomon_Hill
Speights
Spencer_Dinwiddie
Spencer_Hawes
Splitter
Spurs
Stanley_Johnson
State
Stauskas
Stephen
Stephen_Curry
Stephenson
Steve
Steve_Blake
Steve_Novak
Steven
Steven_Adams
Stoudemire
Stuckey
Sullinger
Suns
T.J.
T.J._McConnell
TJ_Warren
Taj_Gibson
Tarik_Black
Taurean_Prince
Tayshaun_Prince
Teague
Teletovic
Telfair
Temple
Terrence_Jones
Terrence_Ross
Terry
Terry_Rozier
Thabo
Thabo_Sefolosha
Thaddeus
Thaddeus_Young
Thomas
Thomas_Robinson
Thompson
Thornton
Thunder
Tiago_Splitter
Tim
Tim_Duncan
Tim_Frazier
Timberwolves
Timofey_Mozgov
Timothe_Luwawu-Cabarrot
Tobias_Harris
Tolliver
Tomas
Tomas_Satoransky
Toney_Douglas
Tony
Tony_Allen
Tony_Parker
Tony_Snell
Tony_Wroten
Toronto
Toronto_Raptors
Towns
Trail
Trail_Blazers
Travis_Wear
Trevor_Ariza
Trevor_Booker
Trey_Burke
Trey_Lyles
Tristan_Thompson
Troy_Daniels
Troy_Williams
Tucker
Turkoglu
Turner
Ty
Ty_Lawson
Tyler
Tyler_Ennis
Tyler_Hansbrough
Tyler_Johnson
Tyler_Ulis
Tyler_Zeller
Tyreke_Evans
Tyson
Tyson_Chandler
Tyus_Jones
Udrih
Ulis
Utah
Utah_Jazz
Valanciunas
Vasquez
Victor_Oladipo
Villanueva
Vince_Carter
Vucevic
Vujacic
Wade
Waiters
Walker
Wall
Warren
Warriors
Washington
Washington_Wizards
Watson
Wayne_Ellington
Weber
Wesley_Johnson
Wesley_Matthews
West
Westbrook
Whitehead
Whiteside
Wiggins
Will_Barton
Williams
Willie_Cauley-Stein
Willie_Green
Willie_Reed
Willy
Willy_Hernangomez
Wilson
Wilson_Chandler
Winslow
Withey
Wizards
World
Wright
Wroten
Yogi_Ferrell
Young
Zach
Zach_LaVine
Zach_Randolph
Zaza
Zaza_Pachulia
Zeller
Zipser
Zubac
PLAYER-AST
PLAYER-BLK
PLAYER-DREB
PLAYER-FG3A
PLAYER-FG3M
PLAYER-FG3_PCT
PLAYER-FGA
PLAYER-FGM
PLAYER-FG_PCT
PLAYER-FTA
PLAYER-FTM
PLAYER-FT_PCT
PLAYER-MIN
PLAYER-OREB
PLAYER-PF
PLAYER-PTS
PLAYER-REB
PLAYER-STL
PLAYER-TO
PLAYER_NAME
TEAM-AST
TEAM-FG3_PCT
TEAM-FG_PCT
TEAM-FT_PCT
TEAM-LOSSES
TEAM-PTS
TEAM-PTS_QTR1
TEAM-PTS_QTR2
TEAM-PTS_QTR3
TEAM-PTS_QTR4
TEAM-REB
TEAM-TOV
TEAM-WINS
TEAM_NAME
$
%
&
'
''
'86
'd
'll
're
's
've
(
)
,
-
-esque
.
.500
.8
0:1
0:16
0:29
0:48
1,0
1,245
1,600th
1,787th
10:21
10:53
10th
10tth
11th
12:30
12th
13th
141
148
14th
150
155th
157
15th
160
161
16th
170
173
17th
180
184
18th
193
1951
1963/64
1969
1970
1971
1974
1975
1985
1988
1989
1991
1992
1993
1994
1995
1997
1998
19990
19th
1:10
1:14
1:15
1:18
1:19
1:23
1:25
1:28
1:30
1:32
1:34
1:35
1:36
1:37
1:38
1:43
1:44
1:47
1:49
1:5
1:51
1:52
1:55
1:7
1:8
2,887
20/20
200
2002
2004
2006
2007
2008
2009
200th
2010s
2011
2012
2013
2014
2015
2016
2017
20:46
20s
20th
210
215th
21st
220
22nd
230
23rd
240
241
24th
259
25th
260
261
266
26th
27,0
273
27th
280
281
28th
290
29th
2:11
2:14
2:15
2:23
2:28
2:30
2:32
2:33
2:35
2:39
2:40
2:45
2:5
2:54
2:56
2:59
2:8
2:9
2nd
30,0
30s
30th
310
31st
32nd
33rd
34th
35th
360
370
37:53
39th
3:12
3:13
3:15
3:2
3:20
3:26
3:29
3:3
3:30
3:31
3:32
3:36
3:4
3:40
3:43
3:54
3:55
3:9
3PM
3PT
3Pt
3rd
40th
41st
43:16
48th
497
4:11
4:18
4:20
4:21
4:24
4:25
4:3
4:30
4:31
4:33
4:40
4:46
4:50
4:52
4:8
4:9
4th
502
50th
510
51st
570
5:0
5:12
5:15
5:16
5:22
5:31
5:33
5:45
5:54
5:55
5x5
60th
6:11
6:13
6:26
6:37
6:39
6:40
6:41
6:43
6:5
6:53
6th
71st
73rd
7:0
7:13
7:24
7:26
7:27
7:28
7:30
7:31
7:35
7:38
7:40
7:43
7:50
7:58
7th
879th
8:1
8:26
8:27
8:30
8:38
8:40
8:42
8:56
8th
9/18
919
9:15
9:26
9:28
9:30
9:4
:
:1
:10
:15
:2
:20
:22
:25
:30
:34
:5
:6
;
A
A-game
ACL
AT
Abdul-Jabar
Abysmal
Accordingly
Achilles
Across
Adding
Additionally
Affalo
After
Afternoon
Against
Aging
Air
Airlines
Airways
Al-Forouq
Aldrige
All
All-Defense
All-NBA
All-Rookie
All-Star
All-Star-caliber
All-Stars
All-star
Almost
Along
Alongside
Already
Also
Altanta
Although
Altogether
Alvin
Amare
Amazingly
America
American
AmericanAirlines
Amidst
Among
Amway
An
And
Angles
Anjinca
Another
Antetekoumpo
Antetenkoumpo
Antetkokounmpo
Antetokonmpo
Antetokunmpo
Anthony-Towns
Antonino
Antony
Any
Apple
Apr
April
Area
Arena
Arguably
As
Aside
At
Atlantic
Auburn
Aussie
Australian
Averaging
Award
B-unit
BMO
Back
Backcourt
Backup
Ball
Banker
Bankers
Barclay
Barclays
Bay
Bazmore
Beal-less
Beard
Before
Behind
Believe
Bellinelli
Bench
Besides
Between
Beverly
Beyond
Big
Billy
Bird
Blatt
Blazer
Blue
Boganovic
Bogdan
Bogdanovich
Borrego
Both
Bouncing
Bowl
Boxing
Brad
Brazilian
Break
Breakout
Brett
Brodgon
Broonlyn
Broooklyn
Brother
Brothers
Bston
Buck
Budenholzer
Bull
Bullets
Burkes
But
Buttressed
By
Byron
C
C.J
CA
Cable
Caldwell
Canada
Canade
Candidate
Canter
Capitalizing
Cappella
Careful
Carlisle
Carmel
Carrol
Cavalier
Cavs
Celeveland
Celitcs
Celtic
Celtices
Center
Central
Centre
Cetlics
Chamberlain
Chander
Chandle
Chesapeake
Chipping
Cincinnati
Cippers
Clarkson-Williams
Clifford
Clipper
Clips
Co.
Coach
Coast
Collectively
Combine
Combined
Comeback
Coming
Compared
Competition
Conely
Conference
Conference-leading
Considering
Continuing
Contrarily
Conversely
Convington
Corbin
Courtesy
Covering
Crabbed
Crey
Cs
Curry-Thompson
Curry-less
D'Antoni
D-League
D.
D.C
D.C.
D.J
DC
DCP-CDs
DJ
DNP-CD
DNP-CDs
DUI
Danillo
Dargic
Darrren
Dating
Dave
Day
DeMare
DeRozean
Deandre
Dec.
December
Decimated
Defense
Defensive
Defensively
Dejuan
Delavedova
Dell
Delladedova
Demmare
Denis
Depth
Derek
Derick
Deroan
Derren
Despire
Despite
Developing
Devner
Dewyane
Division
Divison
Do
Doc
Doing
Dominant
Dominique
Donovan
Doors
Double-double
Down
Draft
Drama
Duantless
Due
Duke
Duncan-less
Dunk
Duran
Durant-Curry
During
Dwayne
E'Twuan
E'twaun
EST
EX
Each
Earlier
Earth
East
East-leading
Eastern
Eatern
Efficiency
Efficient
Eight
Eleven
Elfird
Eliis
Elite
Emanuel
Emerging
Encouragingly
Energy
EnergySolutions
England
Entering
Equally
Erik
Especially
Etwaun
Euroleague
European
Eve
Even
Ever
Every
Everything
Ex
Excellent
Experiment
FG
FGM
FGM-A
FT
Facing
Factoring
Famer
Fans
Fargo
Fastbreak
Fatigue
Favors-like
Favours
Feb
Feb.
February
Fed
FedEX
FedEx
FedExForum
Fee-throw
Fellow
Few
Fg
Field
Fieldhouse
Fill-in
Filling
Final
Finally
Finals
First
First-round
First-time
First-year
Fittingly
Five
Flagrant
Florida
Following
For
Former
Fortunately
Forum
Forward
Forwards
Foul
Four
Four-fifths
Fouriner
Fourth-year
Freak
Free
Free-throw
Free-throws
Frenchman
Frenchmen
Fresh
Fresno
Friday
From
Frontcourt
Ft
Further
Future
Galinari
Gama
Game
Garden
Garnet
Gentry
Georgetown
German
Getting
Ginobli
Given
Giving
Going
Gorat
Gordan
Gragic
Greek
Greene
Gregg
Griz
Grizz
Grizzles
Grizzlies-Blazers
Guard
Guards
Gueroge
Guillermo
Gundy
Hack-a-Drummond
Hakeem
Hakws
Hall
Hall-of-Famer
Halloween
Hardway
Hariston
Hasan
Having
Hawk
He
Head
Heading
Heads
Heild
Heinrich
Helping
Herangomez
Herculean
Hereford
Heyward
High-profile
Hilario
Hillard
Hills
Hinrich-Aaron
His
History
Hitting
Hoford
Hoiberg
Holiis-Jefferson
Home
Honda
Hoot
Hornacek
Hornet
However
II
III
ISO
If
Iguodola
Ilyasov
Ilysova
Impending
Impressive
Improved
In
Including
Indianapolis
Injuries
Instead
Interestingly
Into
Iriving
Irivng
Iron
Ironically
Isiah
It
J.
J.J
J.R
J.R.
Jahil
Jahlik
Jakarr
Jame
Jan
Jan.
January
Jarrell
Jarret
Jarryd
Javale
JeBron
Jeremi
Jeremies
Jersey
Joerger
Johnathan
Joining
Jonson
Jordan-Kobe
Journeyman
Jr
Jr.
July
June
Just
Justice
K.J
KD
Kansas
Kareem
Karl
Keeping
Kentavius
Kentucky
Kerr
Key
Kidd
Kidd-Gilcrhist
King
Knick
Knowing
Kurt
Kyler
L.A.
L2M
LAC
LIllard
LaVert
LaVoy
Lake
Laker
Lamarcus
Largely
Larkers
Last
Lastly
Late
Lavine
LeAndro
LeMarcus
LeVine
Leading
Leagues
Leaondro
Lebron
Led
Lehigh
Levert
Levine
Life
Like
Likely
Lillard-like
Lillards
Limiting
Lionel
Little
Loans
London
Lone
Long-range
Long-time
Looking
Losers
Lottery
Louis
Love-like
Luckily
Luigi
MCL
MIlwaukee
MIrotic
MKG
MRI
MVP
MVP-caliber
MVP-candidate
MVP-type
MVPs
Madison
Mahimi
Mainstay
Making
Malone
Mamba
Man
Manhattan
Manimal
Many
Mar
March
Mareese
Marin
Mark
Markeiff
Markief
Marresse
Maryland
Matching
Matchup
Mathew
Mathews
Maverick
Mavs
McHale
Mclemore
Meanwhile
Meawhile
Melo
Memphihs
Mexico
Michael-McAdoo
Michigan
Midseason
Midway
Milsap
Milwuakee
Mindauguas
Minimal
Minneapolis
Minny
Mitotic
Moda
Monday
Mondays
Month
Montiejunas
Monty
Moon
More
Most
Moving
Much
Muhammed
Muiday
Multiple
Myers
NBA
NBA-best
NBA-high
NBA-issued
NBA-leading
NBA-record
NBA/ABA
NIkola
Near
Nearing
Nearly
Nearng
Neither
Nemana
Nemenja
Nerlen
Net
Nevertheless
Newcomer
Newly
Newly-acquired
Newly-minted
Next
Nic
Nicholas
Nicola
Night
Nike
Nine
No
Nobody
Nogeira
None
Nonetheless
Normally
Northwest
Northwestern
Not
Notable
Notably
Notching
Nothing
Nov.
November
Now
Nowitzki-led
Nowiztki
Nowtizki
Nugget
O'Neal
O.J
O2
OKC
ORACLE
OT
Oakland
Oct.
October
Of
Off
Offense
Offensive
Offensively
Offseason
Okdafor
Olajuwon
Omar
On
Once
One
Only
Opening
Opposed
Opposing
Oracle
Oregon
Orlean
Oscar
Other
Outside
Over
Overall
Overshadowed
Overtime
P.J
P.M.
PER
PM
Pacer
Pacific
Palace
Pelican
Pels
Pepsi
Per
Perennially
Perhaps
Personal
Philadelhpia
Philadelphia-Atlanta
Philadephia
Phili
Philips
Phillips
Philly
Piston
Pitching
Player
Playing
Playoffs
Poetl
Point
Point-forward
Points
Poor
Pope
Popovic
Popovich
Portal
Portand
Porzingus
Posting
Potential
Power
Precious
Predictably
Prior
Prized
Promising
Providing
Prozingis
Pt
Puchulia
Pushing
Quality
Quciken
Quicken
Quite
R.J.
Rambis
Randall
Rando
Raps
Raptor
Rasaul
Reaching
Realistically
Rebounding
Receiving
Recent
Recently
Recently-named
Recently-returned
Recording
Reddick
Regardless
Reigning
Replacing
Reserve
Reserves
Resort
Rest
Restricted
Returning
Ricahun
Richards
Rick
Rim
Rising
Rob
Robertson
Rocket
Rodman
Rolando
Rondae-Hollis
Rookie
Rookies
Roookie
Salt
Sate
Satoramsky
Saturday
Save
Schroeder
Scoring
Seattle
Second
Second-round
Second-year
Sefalosha
Semifinals
Seven
Seven-time
Several
Shaquille
Sharpshooter
Sharpshooting
Shaw
Shooting
Shootout
Shroder
Shumper
Silver
Since
Six
Sixer
Sixers
Sixth
Skiles
Slam
Sleep
Small
Smoothie
So
Solid
Soloman
Solutions
Some
Somewhat
Sophomore
Sophomores
South
Southeast
Southeastern
Southwest
Southwestern
Spaniard
Spanish
Spearheaded
Spectrum
Splash
Splash-Bro
Spoelstra
Spur
Square
Stalwarts
Stan
Standout
Staples
Star
Stars
Starter
Starters
Starting
Stauskus
Steph
Stevens
Stick
Still
Stotts
Strangely
Streaky
Strong
Struggling
Sub-par
Such
Sudden
Suffering
Sullener
Sullenger
Summer
Sun
Sunday
Super
Supersonics
Superstar
Surprisingly
T
T'Wolf
T'Wolves
T-Wolves
T.
T.J
TD
TNT
TOs
TWC
Taking
Talking
Target
Team
Teammate
Tellingly
Ten
Terrance
Texas
Th
Thad
Thankfully
Thanks
That
The
Their
Then
There
These
They
Thibodeau
Thibodeau-like
Things
Third-year
This
Thomson
Those
Though
Three
Three-Point
Three-fifths
Three-point
Three-pointers
Through
Throughout
Thrust
Thunders
Thurday
Thursday
Thus
Timberwolve
Timberwovles
Timbewolves
Timbwerolves
Time
Titanic
Title
To
Tom
Top
Tough
Toyota
Trailblazers
Trailing
Train
Transition
Triple-double
Triple-doubles
Triston
Tuesday
Tuesdays
Tuner
Turkgolu
Turners
Turnovers
Two
Typically
UConn
US
Ultimately
Unable
Unfortunately
United
Unlike
Unsurprisingly
Up
Up-and-coming
Using
Usually
Utility
Valuable
Van
Verizon
Versatile
Very
Veteran
Veterans
Vivint
Vogel
Volunteer
Vuvecic
W
Waiter
Walked
Walton
Warner
Warrior
Wearing
Webber
Wednesday
Wednesday-night
Week
Wells
Wes
West-coast
West-leading
Western
Westrook
What
When
Where
Whereas
While
Wildcat
Wilkins
William
Wilt
Wily
Wing
Wisconsin
Wisconsin-born
With
Without
Wittman
Wiz
Wizard
Wolves
Worth
X-factor
Year
Year-candidate
Youngster
[
``
a
abdominal
abductor
ability
able
ably
abnormally
about
above
abrasion
absence
absences
absent
absolute
absolutely
absurd
absurdly
abundance
abundant
abuse
abused
abusing
abysmal
acceptable
accepted
acclimated
accolades
accompanied
accompany
accomplish
accomplished
accomplishing
accomplishment
accomplishments
accordingly
account
accounted
accounting
accrue
accrued
accruing
acculturated
accummulating
accumualted
accumulate
accumulated
accumulating
accuracy
accurately
accustomed
acheived
achievable
achieve
achieved
achievement
achieving
achilles
acquire
acquired
acquiring
acquisition
acquisitions
acquitted
acrobatic
across
act
action
active
activities
activity
actual
actually
ad
adage
adapating
add
addding
added
adding
addition
additional
additionally
additions
adds
adductor
adequate
adequately
adjusted
adjustments
admirable
admirably
admitting
adopt
adopted
adouble
aductor
advance
advanced
advances
advancing
advantage
advantageous
advantages
advatage
adversaries
adversity
advised
affair
affairs
affect
affected
affecting
affectionately
afflicted
afford
afforded
afloat
aforemented
aforementioned
aformentioned
after
afternoon
afternoons
again
against
ageless
agency
agent
ages
aggravated
aggravating
aggressive
aggressiveness
aging
ago
agree
agressive
ahead
ahold
aid
aided
aiding
ailed
ailing
ailment
ailments
aim
air
alarming
albeit
aligned
alive
all
allegedly
allergic
alleviate
alley
allotment
allow
allowed
allowing
allows
almost
alone
along
alongside
already
also
alter
altercation
altered
alternate
alternative
although
altitude
altogether
always
amass
amassed
amassing
amazing
amazingly
ambush
ambushed
ambushing
amid
amidst
ammunition
among
amongst
amount
amounted
an
analysts
anchor
anchored
anchoring
and
anemic
animal
ankle
annihilated
announced
anomalous
another
ans
answer
answered
answers
anti
anticipated
antics
any
anybody
anymore
anyone
anything
anytime
anywhere
apart
apiece
apparent
apparently
appear
appearance
appearances
appeared
appears
appendectomy
apply
appreciate
apprehension
approach
approached
approaching
approval
approximately
approximating
aptly
aquired
arc
arch
arcing
are
area
areas
arena
arguably
arguing
argument
arises
arm
armor
army
around
array
arrival
arrives
arsenal
arthroscopic
artillery
as
ascend
ascending
ashamed
aside
ask
asked
aspect
aspirations
asserted
asserting
assessed
asset
assignment
assissts
assist
assistance
assisted
assisting
assists
assits
association
assorted
asssists
asssits
assuaged
assured
asterisk
astonishing
astounding
astoundingly
astronomical
at
athletic
athleticism
ato
atop
atrocious
attack
attacked
attempt
attempted
attempting
attempts
attendance
attention
attitude
attributed
atypical
atypically
automatic
avail
availability
available
avenge
avenged
average
averaged
averages
averaging
avoid
avoided
await
awaited
awaits
award
awarded
awareness
away
awful
awhile
awkward
awoke
back
backboards
backbone
backcourt
backcourts
backed
backfired
backourt
backs
backside
backup
backups
bad
badly
bag
bail
bailed
balance
balanced
ball
ballgame
ballhandling
ballistic
ballooned
balls
band
bang
banged
banished
bank
banked
banker
banking
banter
barely
bargain
barrage
barreled
barrier
based
baseline
basic
basically
basis
basket
basketball
baskets
battle
battled
battles
battling
bay
be
beam
bear
beast
beasted
beastly
beat
beatable
beatdown
beaten
beater
beating
beautiful
became
because
become
becomes
becoming
been
before
began
begging
begin
beginning
begins
begun
behind
being
beleaguered
belied
beliefs
belies
believable
belittling
belonged
below
belt
bench
benched
benches
bend
beneath
beneficial
beneficiaries
beneficiary
benefit
benefited
benefitted
berth
besides
besieged
best
bested
besting
bet
bets
better
between
beyond
bid
big
bigger
biggest
bigman
bigs
bilateral
billing
birth
birthday
births
bit
bite
biter
bitten
bitter
bittersweet
bizarre
blame
blank
blasted
blazing
bleak
bleakness
bleeding
blemish
blessing
blew
blink
blistering
blitzed
block
blocked
blocker
blocking
blocks
blood
blossoming
blow
blowing
blown
blowout
blowouts
blows
blurred
board
boards
boars
boast
boasted
boasting
boastly
boasts
bodes
bodies
body
boggling
bold
bolster
bolstered
bolstering
bomb
bone
bonkers
book
books
booming
boos
boost
boosted
booster
boot
booth
border
borderline
borough
both
bothered
bothering
bottom
bounce
bounced
bouncing
bound
bounds
bout
box
braced
bread
break
breakaway
breakdowns
breaker
breaking
breakneck
breakout
breaks
breathing
breeds
breeze
breezed
bricks
brief
briefly
bright
brighter
brightly
brilliance
brilliant
brilliantly
bring
bringing
brings
brining
brink
broad
broadcasts
broke
broken
brother
brothers
brought
bruise
bruised
bruises
brushed
brutal
brutally
bubble
bucked
bucket
buckets
buckle
buckled
budding
bug
build
building
built
bulk
bulldog
bullet
bullets
bullied
bump
bumping
bumps
bunch
bunches
buoyed
burden
buried
burn
burned
burnt
burst
bury
burying
business
bust
busted
buster
busting
busy
but
butter
buy
buzzer
buzzing
by
cake
calamity
calendar
calf
caliber
call
called
calling
calls
calm
came
camp
campaign
can
cancellation
candidate
candidates
cane
canned
canning
cap
capabilities
capability
capable
capital
capitalize
capitalized
capitalizing
capped
capping
caps
capture
captured
capturing
care
careened
careening
career
careers
careful
careless
carelessness
carried
carry
carrying
carve
carving
case
cased
cash
cashing
cast
catalyst
catch
catching
categories
category
caught
cause
caused
causing
caution
caved
ccaught
ceding
celebrate
celebrated
celebrating
cellar
cemented
center
centerpiece
centers
central
century
certain
certainly
chair
chairs
challenge
challenged
challenging
champion
champions
championship
champs
chance
chances
change
changed
changer
changes
changing
channeled
chants
chaos
chaotic
characteristically
charge
charged
charging
charity
chart
chase
chasing
chatter
check
checked
checking
cheers
chest
chimed
chip
chipped
chipping
chippy
chips
choice
choked
chokes
chose
chucked
chucking
chugging
chunk
churned
churning
circle
circles
circulating
circumstance
circus
city
claim
claimed
claiming
clamped
clash
clashed
class
classic
claw
clawed
clawing
clean
cleaned
clear
cleared
clearing
clearly
clicked
clicking
clicks
climactic
climb
climbed
climbing
clinch
clinched
clinching
clinging
clinic
clip
clock
clocked
clogging
close
closed
closely
closer
closest
closing
clots
club
clubs
clunky
clutch
clutched
co
coach
coached
coaches
coaching
coast
coasted
coaster
coasting
coattails
coaxed
coaxing
cobbled
coffin
cog
coin
coincided
coincidence
coinciding
cold
collapse
collapsed
collapses
collapsing
collect
collected
collecting
collective
collectively
collision
colors
column
columns
combat
combed
combination
combinations
combine
combined
combining
combo
come
comeback
comes
comfort
comfortable
comfortably
coming
comission
commanded
commanding
commence
commencing
commendable
comments
commissioner
commit
commited
commiting
commitment
committed
committee
committing
commmitted
common
commonly
communication
commuted
company
compared
comparison
compensate
compensated
compensating
compete
competed
competetive
competing
competition
competitive
competitively
competitiveness
compile
compiled
compiling
complement
complementary
complemented
complementing
complete
completed
completely
completing
completion
compliment
complimented
component
components
composed
composure
compounded
comprised
conceded
concept
concerned
concerning
concerns
conclude
concluded
concludes
concluding
conclusion
concussed
concussion
conditioning
conduct
conested
conference
confidence
confident
confirmed
connect
connected
connecting
conquered
consectuive
consecutive
consequently
consider
considerable
considerably
consideration
considered
considering
consisted
consistency
consistent
consistently
consisting
constant
constantly
contact
contagious
contain
contained
containing
contast
contemplating
contempt
contend
contender
contenders
contending
contention
contest
contested
contesting
contests
contines
contingent
continually
continue
continued
continues
continuing
continuous
continuously
contract
contrary
contrast
contrasting
contribute
contributed
contributes
contributing
contribution
contributions
contributor
contributors
control
controlled
controlling
controversial
controversy
contusion
conversation
conversion
convert
converted
converting
conveting
convey
convincing
convincingly
cool
cooled
cooler
core
corner
cornerstone
corral
corralled
correct
correlates
correlation
corresponding
cost
costly
coughed
coughing
could
count
counted
counter
counteract
countered
countering
counterpart
counterparts
counting
countless
couple
coupled
course
court
courtesy
cover
covered
covering
coverting
coveted
crack
cracked
cracking
craftier
craftmanship
crafty
crashed
crashing
crawl
crawled
crazy
create
created
creating
creation
credit
credited
creep
creeping
crept
crescendo
crew
crime
crisis
crisp
critical
criticism
crooked
cross
crowd
crowded
crowned
crucial
cruel
cruise
cruised
cruising
crunch
crushed
crushing
culled
culminated
culminating
culprit
culprits
cultivated
cumulative
cup
curator
cure
current
currently
cushion
customarily
customary
cut
cutters
cutting
cylinders
dagger
daggered
daggers
damage
dampening
dampens
danger
dangerous
dark
darkhorse
darted
date
dating
day
daylight
days
de
deactivation
dead
deadeye
deadline
deadlock
deadlocked
deadly
deal
dealing
dealings
deals
dealt
death
debilatated
debut
debuting
debuts
decade
decades
deceiving
decent
decide
decided
decidedly
decimate
decimated
decimating
decision
decisive
decisively
deck
decline
deemed
deep
deeper
defacto
defeat
defeated
defeating
defeatist
defeats
defend
defended
defender
defenders
defending
defense
defenses
defensive
defensively
defensvie
defer
deferment
deferred
deffense
deficiencies
deficit
deficits
defining
definitely
definition
definitive
definitively
deflated
deflating
degree
delayed
deliver
delivered
delivering
demise
demolished
demonsrated
demonstrated
demonstrating
demoralized
demoted
demotion
dent
denver
deny
departed
departing
department
departments
departure
departures
dependable
dependent
depleted
deployed
deploying
depth
derail
derailing
derided
deserve
deserved
deserves
deserving
designation
designs
desired
desperate
desperately
desperation
despite
destined
destroy
destroyed
determined
determing
dethrone
detract
detrimental
devastated
devastating
develop
developed
developing
development
dfive
diagnosed
diagnosis
dial
dialed
diamond
dice
diced
dictate
dictated
did
die
differ
difference
differences
different
differential
differentials
differentiate
difficult
difficulties
difficulty
dig
digit
digits
digs
dime
dimes
dip
dipped
dire
direct
directed
direction
directions
directly
dirty
disadvantage
disadvantages
disallowed
disallowing
disapointing
disappeared
disappoint
disappointed
disappointing
disappointingly
disappointment
disappointments
disarray
disaster
disastrous
disciplinary
discouraged
discrepancy
discuss
discussed
discussion
disguise
dish
disheartened
dished
dishing
disinterested
dismal
dismantling
disparity
dispatch
displaced
display
displayed
displeasure
disposal
disposed
disrupt
dissapoint
dissapointed
dissapointing
dissuade
distance
distant
distinct
distinction
distinguished
distribute
distributed
distributing
distribution
distributor
distributors
disturbing
ditch
diverse
dividends
diving
division
divisional
do
dobule
dockett
doctor
documented
dodged
does
dog
dogs
doing
doldrums
doled
doling
dominance
dominant
dominantly
dominate
dominated
dominating
domination
done
donning
doomed
dooming
door
dose
double
doubled
doubles
doubling
doubly
doubt
doubters
doubting
dougle
down
downed
downfall
downgrade
downhill
downplays
downright
downside
downtown
downturn
downward
draft
drafted
drafts
dragged
drain
drained
draining
drama
dramatic
dramatically
drastic
drastically
draw
drawing
drawn
draws
dreadful
dreadfully
dream
dreams
dressed
drew
dribble
dribbled
drill
drilled
drilling
drive
drived
driving
drop
dropoff
dropped
dropping
droppped
drops
drought
droughts
drove
droves
drubbing
drug
dry
dubious
dubiously
dud
duds
due
duel
dueling
dug
dumped
dunk
dunked
dunks
duo
duos
duplicate
duplicating
duration
during
duties
duty
dwellers
dwindle
dwindled
dwindling
dying
dynamic
dysfunctional
each
eager
eaked
earlier
earliest
early
earmarked
earn
earned
earning
earth
ease
eased
easier
easily
easing
east
easy
ecipsed
eclipse
eclipsed
eclipsing
edge
edged
edging
effecient
effect
effected
effective
effectively
effects
efficacy
efficiency
efficient
efficiently
effort
effortless
efforts
eighth
eights
eigth
either
ejected
ejection
elated
elbow
elbowed
elbowing
elder
elected
electric
electrifying
elegant
elevated
eleventh
elicit
elicited
eliciting
elicted
elicting
eliminated
eliminates
elimination
elite
else
elsewhere
elusive
emanated
emanating
embark
embarked
embarking
embarks
embarrassed
embarrassing
embarrassingly
embody
emerge
emerged
emergence
emerging
emotional
emphasis
emphasize
emphatic
employed
employee
employer
employing
empty
en
enabled
enbaled
encore
encounter
encountered
encouraged
encouraging
encouragingly
end
ended
ending
ends
endured
enduring
enemy
energetic
energizer
energy
engage
engaged
engine
enjoy
enjoyed
enjoying
enormous
enough
ensued
ensuing
ensure
ensuring
enter
entered
entering
enters
entertain
entertaining
entire
entirely
entirety
entrenched
environment
envisioned
epic
epitomized
equal
equaled
equaling
equalizer
equally
equipment
equipped
era
eradicated
erase
erased
erroneous
error
errors
erupted
eruption
escalated
escape
escaped
escaping
especially
essential
essentially
establish
established
establishing
eurostep
evaluation
evaporate
evaporated
even
evened
evening
evenly
eventful
events
eventual
eventually
ever
every
everyone
everyones
everything
everywhere
evidenced
evident
ex
exact
exacted
exactly
examination
example
exceeded
exceedingly
excel
excelled
excellent
except
exception
exceptional
exceptionally
exceptions
exchange
exchanged
exchanges
exchanging
exciting
exclamation
excluding
excruciating
excursion
excuse
execute
execution
exemplified
exemplifies
exemplifying
exercised
exercising
exert
exhausted
exhausting
exhibited
exhibiting
exhibition
exhibtion
exhilirating
existent
exit
exited
exiting
expand
expanded
expanding
expect
expectations
expected
expecting
expects
expense
experience
experienced
experiencing
experiment
expert
experts
expire
expired
expires
expiring
explode
exploded
exploding
exploit
exploited
exploiting
explosion
explosive
exponentially
exra
extend
extended
extending
extends
extension
extensive
extent
extinguishing
extra
extraordinare
extravaganza
extremely
eye
eyes
f
face
face/eye
faced
faces
facet
facets
facial
facilitate
facilitated
facilitating
facilitator
facility
facing
fact
facto
factor
factors
fade
fadeaway
faded
fading
fail
failed
failing
faint
fair
faired
fairing
fairly
fall
fallen
falling
falls
falter
faltered
faltering
familiar
familiarity
family
fan
fans
fanstastic
fantastic
fantasy
far
fare
fared
farewell
farther
fascia
fasciitis
fascitis
fashion
fashioned
fast
fastbreak
faster
fastest
fate
father
fatigue
fatigued
favor
favorable
favorite
favorites
favors
fazed
fearless
feast
feasted
feat
feature
featured
features
featuring
feed
feel
feeling
feels
feet
feistiest
feisty
fell
felled
fellow
felt
fend
fending
ferocious
few
fewer
fiasco
fibula
field
fielded
fierce
fiesty
fifteenth
fifth
fifths
fight
fighting
figure
figured
figures
filed
filing
fill
filled
filling
fills
final
finale
finally
finals
find
finding
finds
fine
finest
finger
fingernail
fingers
fininshed
fininshing
finised
finish
finished
finishers
finishes
finishing
finshing
fire
fired
firepower
fireworks
firing
firm
firmly
first
fist
fit
fitting
fittingly
fives
fixture
flagarant
flagrant
flair
flared
flashed
flashes
flashiness
flashing
flashy
flat
flawed
flawless
flaws
flex
flexed
flexor
flies
flinch
flip
flipped
flips
flirt
flirtatious
flirted
flirting
floater
floaters
floating
flooded
floodgates
flooor
floor
flopped
floundered
floundering
flow
flowing
flown
flu
fluid
fluke
fly
flyer
focal
foced
focus
focused
focusing
foe
foes
foiled
fold
folded
folks
follow
followed
following
followups
foot
footed
footer
footing
for
force
forced
forces
forcing
forefront
forehead
foreseeable
forever
forge
forged
forget
forgettable
forgetten
forging
form
formality
former
formerly
formidable
forming
formula
formulate
fort
forth
fortify
fortunate
fortunes
forward
forwards
fought
foul
fould
fouled
fouling
fouls
found
foundation
fours
foursome
fourteenth
fourth
fracture
fractures
frailties
frame
frames
franchise
franchises
frazzled
freak
free
frenetic
frequency
frequent
frequently
fresh
frigid
fringe
from
front
frontcourt
frontcourts
fronted
frontline
frontrunner
frozen
fruitful
fruition
frustrated
frustrating
frustration
frustrations
fuel
fueled
fueling
fuelled
fulfilled
fulfilling
full
fullest
fully
fumbled
fumes
fun
functioned
fundamental
funk
furious
furnished
furnishing
further
furthered
furthering
furthers
fury
futile
futility
future
gaff
gain
gained
gaining
gamble
game
games
gap
gaps
garbage
garnered
garnering
gas
gash
gasp
gassed
gate
gates
gathered
gathering
gaudy
gave
gay
gear
gears
gel
gelling
general
generally
generate
generated
generating
generous
get
gets
getting
ghastly
giant
gift
gigantic
gim
give
giveaways
given
gives
giving
glad
glance
glaring
glass
go
goading
goal
goals
goaltended
goaltending
gobbled
gobbling
godsend
goes
going
goings
golden
gone
goo
good
got
gotten
grab
grabbe
grabbed
grabbing
grace
graceful
gradually
grand
granted
grappling
grasp
great
greater
greatest
greatly
greedy
green
grew
grim
grind
grinded
grinder
grinding
grip
grit
gritted
gritty
groin
groove
ground
group
grow
growing
grown
growth
grueling
guaranteed
guard
guard/forward
guarded
guarding
guards
guests
guide
guided
guides
guilty
gun
gusto
gutsy
guy
guys
habit
hack
had
hadd
hail
hair
half
halfs
halftime
halfway
hall
halt
halted
halting
halves
hampered
hampering
hamstring
hand
handed
handedly
handedness
handful
handicapped
handily
handing
handle
handled
handler
handling
hands
handy
hang
hanging
hapless
happen
happened
happy
hard
hardly
has
hat
haul
hauled
hauling
hault
have
having
havoc
hawks
he
head
headache
headed
heading
headlines
heads
headway
heady
heal
health
healthier
healthiest
healthy
heart
heartbreaker
heartbreaking
heat
heated
heating
heave
heavenly
heavier
heaviest
heavily
heavliy
heavy
hectic
heel
heels
hefty
held
heled
hell
helm
help
helped
helpers
helpful
helping
helpless
helps
heralded
herculean
here
hernia
hero
heroic
heroics
hiccups
hide
hideous
high
higher
highest
highlight
highlighted
highlighting
highly
highs
him
himself
hindered
hindering
hint
hip
his
historic
historically
history
hit
hitch
hits
hitting
hobbled
hoist
hoisted
hold
holders
holding
holdout
holds
hole
holes
home
homecoming
homecourt
homestand
hometown
honor
honors
hook
hooked
hoop
hop
hope
hoped
hopeful
hopefully
hopeless
hopes
hoping
hopped
horn
horrendous
horrible
horrid
horridly
horrific
hospitalized
host
hosting
hosts
hot
hotly
hottest
hound
hounding
hovering
how
however
huddle
huge
hugged
human
humilation
humiliating
humming
hump
hung
hungry
hunt
hurdle
hurled
hurt
hurting
hurts
hustle
hustled
hype
hyper
ice
iced
icing
iconic
ideal
ideas
identical
identity
idle
if
iffy
ignite
ignore
ill
illness
illustrated
illustrating
illustrative
imagine
imagined
imbalance
immaculate
immediate
immediately
immense
immensely
immune
impact
impacted
impactful
impeccable
impeccably
imperative
implant
implement
implemented
implications
implied
implying
import
importance
important
importantly
imposed
imposing
impossible
impress
impressed
impressing
impression
impressive
impressively
improbabilities
improbable
improve
improved
improvement
improvements
improves
improving
in
inability
inaccuracy
inactive
inbound
inbounded
inbounds
inch
inches
incident
include
included
includes
including
inclusion
inconsistent
increase
increased
increasing
increasingly
incredible
incredibly
inculding
indefinitely
indicate
indicated
indicates
indication
indicative
indicator
individual
induced
inducing
ineffective
inefficiencies
inefficiency
inefficient
inept
inexperience
inexperienced
inexplicably
infamous
infected
infection
inferior
inflamation
inflammation
inflicted
infraction
infusion
initial
initially
injured
injuries
injuring
injury
inking
inklings
inlcuding
inner
inopportune
inordinate
inordinately
ins
insane
insecure
insert
inserted
inserting
insertion
inside
inspiration
inspired
installment
instance
instant
instead
instrumental
insufficient
insure
insured
insurmountable
intact
integral
intended
intense
intensity
intent
intentional
intentionally
intentions
intercepting
interconference
interest
interesting
interfered
interference
intergral
interim
interior
interlocked
intermission
intimidating
into
intra
intriguing
invaluable
invested
invisible
involved
iron
ironclad
ironic
ironically
irrelevant
irving
is
iso
issue
issued
issues
it
its
itself
jack
jacked
jam
jammed
jaw
jaws
jazz
jeopardy
jerseys
jets
jittery
job
jockey
jockeying
join
joined
joing
joining
jordan
journey
journeyman
juggernaut
juice
jump
jumped
jumper
jumpers
jumping
juncture
just
justice
juust
keep
keeping
keeps
kept
key
keyed
keying
keys
kick
kicked
kicking
kicks
kickstarted
kidding
killed
killer
kind
kinds
kissed
knee
knees
knew
knit
knock
knocked
knocking
knot
knotted
know
knowing
known
kristaps
label
laceration
lack
lacked
lacking
lackluster
lad
ladder
laden
lagged
laid
land
landed
landing
lane
lanes
lanky
lapse
lapses
large
largely
larger
largest
last
lasted
lasting
late
lately
later
latest
latter
lauded
laugh
laugher
launch
launched
launcher
launching
lay
layup
layups
lazy
lead
leader
leaders
leadership
leading
leads
league
leaky
lean
leaned
learn
learned
least
leave
leaves
leaving
led
ledger
left
leg
legitimate
legs
lend
length
lengthy
lent
less
lesser
let
letdown
lethal
letting
level
leveled
levels
leveraged
levied
lick
lid
lieu
life
lift
lifted
lifting
ligament
light
lighted
lighter
lighting
lights
like
liked
likely
likes
likewise
limit
limited
limiting
limped
linchpin
linchpins
line
lines
lineup
lineups
lingering
lining
links
lip
list
listed
lists
lit
litany
literally
little
live
lived
lives
living
lll
load
loaded
loads
local
located
lock
lockdown
locked
locker
locking
locks
lofty
log
logged
logging
lone
long
longer
longest
longus
loo
look
looked
looking
looks
loomed
looming
loose
lopsided
lose
losers
loses
losing
loss
losses
lost
lot
lots
lottery
lousy
love
loving
low
lower
lowered
lowest
lowlighted
lowly
lows
luck
luckily
lucky
ludicrous
lukewarm
lull
lungs
luster
luxury
machine
made
madness
maestro
magic
magical
main
mainly
mainstays
maintain
maintained
maintaining
maintains
majestic
major
majority
make
makeover
maker
makes
making
malaise
maligned
mammoth
man
manage
managed
management
manager
managing
manhandled
manhandling
manned
manner
manning
many
march
marching
margin
marginal
mark
marked
markedly
market
marking
marks
marksman
marksmanship
marksmen
marquee
marvelous
marvelously
mary
mask
massive
massively
master
masterful
masters
match
matched
matches
matching
matchup
matchups
mate
materialize
mates
mathematically
matinee
matinees
matter
mattered
matters
maturation
max
maximize
maximized
may
me
meager
meagre
mean
meaning
meaningful
meaningless
means
meant
meanwhile
meanwhlie
measley
measly
measure
measured
med
medical
medically
mediocre
mediocrity
meet
meeting
meetings
meltdown
meltdowns
member
members
memeber
memorable
memory
men
menagerie
meniscus
mentality
mention
mentioned
mercurial
mere
merely
mesh
mess
message
met
methodical
methodically
metric
microcosm
mid
middle
middled
middling
midpoint
midrange
midseason
midst
midway
might
mightily
migraine
migraines
mildly
milestone
million
mind
minded
minds
mindset
mini
minimal
minimally
minimize
minimum
minor
mintues
minues
minus
minuscule
minute
minutes
minuteus
miracle
miraculous
miraculously
mired
mirotic
miscues
miserable
misfire
misfired
misfires
misfiring
misfortune
mishap
mishaps
mismatch
mismatches
miss
missed
misses
missing
mission
mist
mistake
mistakes
mistimed
mix
mixed
mnutes
mob
mode
model
moderate
moderately
modest
modestly
moment
momentarily
momentary
momentous
moments
momentum
money
moniker
monolithic
monroe
monster
monstrous
montages
month
months
monumental
mood
more
most
mostly
mother
motion
motivated
motivation
mount
mounted
mounting
mouth
move
moved
movement
moves
moving
much
multi
multiple
multitude
murder
muscle
muscled
muscles
must
mustard
muster
mustered
mustering
my
n
n't
nabbed
nabbing
nagging
nail
nailbiter
nailed
nailing
name
named
namely
names
narrative
narratives
narrow
narrowing
narrowly
nasal
nasty
nation
nationally
natural
naturally
nature
naught
navigate
navigating
naysayers
nealry
near
neared
nearing
nearly
necessarily
necessary
necessitated
neck
need
needed
needing
needs
negate
negated
negative
negotiations
neighboring
neither
neophyte
net
nets
netted
netting
neutered
neutralize
neutralized
never
nevertheless
neverthless
new
newcomer
newcomers
newest
newfound
newly
news
next
nice
nicely
nickname
nifty
night
nightly
nightmare
nightmarish
nights
ninth
nip
nipped
no
nobody
nod
nods
noise
nominee
non
none
nonetheless
norm
normal
normally
north
nose
nostalgic
not
notable
notably
notch
notched
notches
notching
note
noted
noteworthy
nothing
notice
noticeable
noticeably
noting
notion
notions
notorious
notoriously
nototriously
notwithstanding
now
nowhere
nucleus
nullified
nullify
number
numbers
numerous
nurse
nursing
nutshell
oblique
obliterated
obliteration
obstacle
obvious
obviously
occasion
occasionally
occasions
occurred
occurrences
octane
odd
oddly
odds
of
off
offenders
offense
offenses
offensive
offensively
offer
offered
offering
official
officially
officials
offseason
offseasons
offset
oft
often
oiled
old
on
once
one
ones
ongoing
only
onslaught
onto
onus
oop
oops
open
opened
opener
opening
opens
operating
operator
opponent
opponents
opportunistic
opportunities
opportunity
oppose
opposing
opposite
opposition
opt
opted
optimism
optimistic
option
options
or
orbital
order
ordered
ordinary
organization
organize
oriented
originally
other
others
otherwise
our
oustanding
ousted
ouster
out
outage
outasissted
outassisted
outassisting
outassistted
outburst
outbursts
outcome
outdid
outdone
outing
outings
outlast
outlasted
outlasting
outlier
outlying
outmanned
outmatched
outmuscled
outmuscling
outnumbered
outpace
outpaced
outpacing
outperform
outperformed
outperforming
outplayed
output
outputs
outrebound
outrebounded
outrebounding
outright
outrunning
outs
outscore
outscored
outscoring
outshined
outshooting
outshot
outside
outstanding
outweighed
over
overabundance
overachieved
overall
overcame
overcome
overcoming
overconfidence
overlook
overmatched
overpowered
overs
overshadowed
overtake
overtime
overtimes
overtook
overwhelm
overwhelmed
overworked
own
owned
owners
owning
owns
p.m.
pace
paced
pacing
pack
packed
packing
padded
page
paid
pain
painful
pains
paint
pair
paired
pairing
pairo
paltry
panic
paper
papercut
par
parade
parlayed
part
partially
participate
particular
particularly
particulary
partly
partner
parts
party
pass
passed
passers
passes
passing
passionate
passive
past
patch
patented
paternity
path
pathetic
pattern
pave
paved
paving
pay
payday
payed
payers
peak
peaked
peaking
pecent
pedal
pedestrian
pedigree
pelvic
pelvis
penalty
penchant
pending
penny
people
per
percent
percentage
percentages
percnet
perennial
perfect
perfection
perfomance
perform
performance
performances
performed
performer
performers
performing
perfromance
perhaps
peril
perimeter
perimter
period
periods
permanent
permeable
perpetual
perpetually
perrcent
perseverance
persevered
persist
persisted
person
personal
personified
personnel
pesky
pest
pestered
phase
phenom
phenomenal
photo
physical
physically
pick
picked
picking
picks
pickup
picture
piece
pieces
pierce
pile
piled
pilfering
piling
pine
ping
pinpoint
pioints
pitch
pitched
pitching
pivotal
place
placed
placeholder
places
plagued
plan
plane
planned
plans
plantar
plate
plateau
platry
play
played
player
players
playing
playmaker
playmakers
playmaking
playoff
playoffs
plays
playtime
pleading
pleasant
pleasantly
pleasure
plenty
plug
plugs
plus
plus/minus
plying
pneumonia
point
pointe
pointed
pointer
pointers
pointing
pointline
points
poise
poised
polar
pole
policy
polished
pondering
pong
ponts
pool
poor
