Alimentum
Aromi
Bibimbap_House
Blue_Spice
Browns_Cambridge
Clowns
Cocum
Cotto
Fitzbillies
Giraffe
Green_Man
Loch_Fyne
Midsummer_House
Strada
Taste_of_Cambridge
The_Cambridge_Blue
The_Cricketers
The_Dumpling_Tree
The_Eagle
The_Golden_Curry
The_Golden_Palace
The_Mill
The_Olive_Grove
The_Phoenix
The_Plough
The_Punter
The_Rice_Boat
The_Twenty_Two
The_Vaults
The_Waterman
The_Wrestlers
Travellers_Rest_Beefeater
Wildwood
Zizzi
1_out_of_5
3_out_of_5
5_out_of_5
All_Bar_One
Avalon
Burger_King
Café_Adriatic
Café_Brazil
Café_Rouge
Café_Sicilia
Chinese
Clare_Hall
Crowne_Plaza_Hotel
English
Express_by_Holiday_Inn
French
Indian
Italian
Japanese
Rainbow_Vegetarian_Café
Raja_Indian_Cuisine
Ranch
The_Bakers
The_Portland_Arms
The_Six_Bells
The_Sorrento
Yippee_Noodle_Bar
average
cheap
city_centre
coffee_shop
family_friendly
fast
high
less_than_£20
low
moderate
more_than_£30
not_family_friendly
pub
restaurant
riverside
£20-25
A
AVERAGE
Above
According
Across
Additionally
Adjacent
Adult
Adult-only
Adults
Affordable
After
Age
Ah
Alcoholic
All
All-Day
Almost
Along
Alongside
Also
Although
Always
Amazing
American
American-style
Among
Amongst
An
And
Another
Anyone
Area
Arms
Aromis
Around
As
Asian
At
Atmosphere
Available
Average
Average-rated
Averagely
Away
Bad
Baker
Bar
Bargain
Based
Be
Beautiful
Beef
Beer
Being
Below
Beluga
Beside
Besides
Best
Between
Bibimbap
Blow
Blue
Boasting
Both
Breakfast
Breakfasts
Bring
Bringing
British
British-inspired
British-style
British-styled
Browns
Buns
Burger
Burgers
But
By
Café
Café_Rouge.6
Café_Sicilia-is
Café_Sicilian
Caféinated
Caféteria
Called
Cam
Cambridge
Can
Canadian
Carryout
Centrally
Centre
Charging
Cheap
Cheaply
Cheat
Check
Cheese
Cheeses
Chelsea
Cheshire
Chesterton
Child
Children
Chines
Chinese-serving
Chopsticks
City
City-center
City-centre
Classic
Close
Cocum-
College
Come
Coming
Competitively
Considered
Consumer
Consumers
Convenient
Conveniently
Costing
Costs
Costumer
Cotton
Crown
Cuisine
Currently
Curried
Curry
Customer
Customers
DE
Delicious
Delivers
Described
Despite
Did
Dine
Diners
Dishes
Do
Does
Dogs
Down
Downtown
Drop
Due
Dulwich
Dumpling
E20
E20-25
E20-E25
E30
Earning
East
Eat
Eat-in
Eatery
Eating
End
English-fare
English-style
English-styled
Enjoy
Environment
Establishment
Euro
Europe
European
Euros
Even
Ever
Everyone
Excellent
Expect
Expensive
Expensively
Express_by_Holiday_Inns
Facilities
Fairly
Falling
Families
Family
Family-
Family-Oriented
Famous
Fancy
Far
Featuring
Feed
Feel
Finally
Find
Finding
Fitzbilies
Five
Five-Star
Food
Foods
For
Forbid
Fore
Found
France
French-food
French-style
French-styled
Fresh
Friend
Friend-family
Friendliness
Friendly
From
Fruits
Full
Fun
Further
GBP
Gastropub
Get
Giraffes
Given
Glisson
Go
Golden
Good
Grab
Great
Greek
Grill
Grove
Hamburger
Handicapped
Happy
Has
Have
Having
He
Head
Hello
Her
Here
High
High-cost
High-end
High-priced
High-quality
Higher
Highest
Highly
Highly-rated
Hill
Hire
His
Holiday
Home
Hortons
Hot
Hotel
House
How
However
Hugh
I
IF
IT
Ia
Ideal
Ideally
If
Improving
In
India
Indian-serving
Indian-style
Indiana
Inexpensive
Inn
Irresistible
Is
It
Italian-inspired
Italian-style
Italy
Its
Japan
Japanese-food
Japanese-style
Japaneses
John
Join
Junior
Just
Keep
Key
Kick
Kid
Kid-free
Kids
Known
L
L20
L20-25
L30
Lasagna
Last
Leave
Less
Let
Lets
Licensed
Like
Lion
Local
Locate
Located
Locates
Location
Loch_Fynes
Look
Looking
Love
Loved
Low
Low-cost
Low-priced
Low-rated
Lower
Lowly
Luton
Majority
Make
Mama
Many
May
Maybe
McDonalds
Meal
Meals
Mediocre
Mediterranean
Medium
Menu
Mercie
Mia
Mid
Mid-cost
Mid-priced
Mid-range
Middle
Moderate
Moderately
Moderately-priced
More
Most
Must
My
NEA
NON
NOT
Name
Named
Near
Nearby
Need
Nestled
New
Next
Nice
No
Non-family_friendly
Noodle
Noodles
Normally
North
Northern
Northwest
Not
Note
Number
OK
OT
Off
Offering
Offers
Often
Olive
On
One
One-star
Only
Open
Opposite
Orders
Oriental
Oriented
Other
Our
Outside
Outstanding
Over
Overall
Overpriced
PS
Parents
Park
Parking
Passing
Pasta
Paying
Peas
Pembroke
People
Perfect
Perhaps
Picturesque
Place
Plates
Plaza
Please
Plus
Poor
Poorly
Poorly-rated
Pop
Popular
Portland
Pound
Pounds
Previous
Price
Priced
Prices
Pricey
Pricing
Providing
Pub
Pub-style
Public
Quaint
Quality
Quid
Quite
Raja
Rang
Range
Ranges
Ranging
Ranked
Ranting
Rate
Rated
Rates
Rating
Ratings
Ravings
Rd
Reasonable
Reasonably
Receiving
Recent
Recently
Regularly
Relatively
Restaurant
Reviewers
Reviews
Rich
Right
River
Riverside
Riversides
Road
Romantic
Rough
Sat
Satisfied
Scored
Scores
Scoring
Seen
Selling
Sells
Sensibly
Serves
Serving
Set
Shop
Shrimp
Sicilian
Since
Sip
Sited
Sits
Sitting
Situated
Slightly
So
Some
Sorry
South
Spaghetti
Specialized
Specializing
Spectrum
Spend
Spice
Spirits
Splurge
Sporting
St
St.
Star
Start
States
Steak
Steve
Stop
Stunning
Style
Styled
Suitable
Superb
Sushi
Tailoring
Take
Tapas
Taste
Tasty
Th
Thai
Thames
That
The
The_Bakers..
The_Bakers.This
The_Eagles
The_Golden_Curry-
The_Mills
The_Punter-
The_Punter-located
The_Punters
The_Rice_Boat-
The_Watermans
Their
Theme
There
Theres
They
This
Though
Three
Tim
Tired
To
Top
Traditional
Travellers_Rest_Beefeaters
Treat
Tree
Trinity
Trumpington
Try
Tucson
Tuscan
Twenty
Two
Type
Typical
Typically
UK
USA
Unfortunately
Unfriendly
United
Unsuitable
Upscale
Us
Variety
Vault
Vegetable
Venue
Very
Visit
Visiting
Wakey
Want
We
Weather
Welcome
Welcoming
Well
Well-reviewed
What
When
Where
Which
While
Whilst
Who
Whole
Why
Will
Wine
Winery
Wines
With
Within
World
Would
Wrestlers
Yard
Yes
Yet
Yippe
Yippee_Noodle_Bart
You
Your
Zizzis
a
a1out
able
abounds
about
above
above-average
absolutely
abysmal
accept
acceptable
accepts
access
accessible
acclaimed
accommodate
accommodated
accommodates
accommodating
accommodations
accompanied
according
accordingly
achieved
achieves
achieving
across
actively
activities
activity
actually
ad
add
added
addictive
addition
additionally
adequate
adequately
adjacent
adjourning
adult
adult-
adult-friendly
adult-only
adult-oriented
adult-time
adults
adults-only
adventuress
advertise
advice
advised
afford
affordable
affordably
affording
after
afternoon
age
ages
ahead
ai
aim
aimed
aims
airing
albeit
alcohol
alcoholic
alike
all
all-day
all-you-can
allow
allowed
allows
almost
alone
along
alongside
already
also
alternative
alternatives
although
always
am
amazing
amazingly
ambiance
ambient
amenities
amicable
among
amongst
amount
amusing
an
and
another
ans
answer
antipasto
any
anyone
anything
anywhere
appeal
appear
appetite
appetizer
appetizers
appropriate
approval
approved
approx
approximately
aptly
are
area
area-
area..
areas
ares
around
arrangement
array
arrive
artisan
as
ask
assessment
assorted
assortment
at
ate
atmosphere
atrocious
attained
attention
attentive
attitude
attracting
attraction
attractive
attracts
audience
authentic
available
average-
average-level
average-price
average-priced
average-quality
average-rate
average-rated
average-rating
averaged
averagely
averagely-priced
averagely-rated
averages
averaging
avoid
award
awarded
aware
away
awed
awesome
awful
babies
baby
babysitter
back
backed
bacon
bad
badly
baked
bakeries
bakery
bakes
bakey
baller
bang
bank
banks
bar
barely
bargain
bargains
base
based
basic
basis
bathroom
bathrooms
be
beans
bear
bearable
beast
beat
beaten
beats
beautiful
beautifully
because
become
becoming
been
beer
begin
beginning
behind
being
believe
below
below-average
beluga
benefit
bes
beside
besides
best
better
between
beverage
beverages
beware
big
bigger
bill
billiard
bird
bis
bistro
bit
bite
bites
block
blocks
blow
board
boast
boasting
boasts
boat
boats
books
boost
boot
both
bottle
bought
bound
bracket
brag
braking
brasserie
brave
bread
breads
break
breakfast
breakfasts
breaking
breathtaking
brew
brilliant
bring
bringing
brings
buck
bucks
budge
budget
budgets
buds
build
building
built
burger
burgers
business
bustling
busy
but
buy
by
ca
caked
call
called
calm
calming
campus
can
cant
care
careful
carer
carries
carryout
cast
casual
categories
category
cater
catered
catering
caters
cause
caused
cautious
celebrate
celebrating
center
center.
central
centrally
centre
centric
certainly
chain
chains
change
chaps
charge
charges
charging
charming
chart
charts
cheap-priced
cheaper
cheaper-side
cheapest
cheaply
cheaply-priced
cheat
check
checkbooks
checked
cheep
cheese
cheeseboards
cheeses
child
child-free
child-unfriendly
child-welcoming
childhood
childless
children
children-
children-free
chill
chines
chips
choice
choices
choose
chop
chopping
cit
cite
cities
citing
city
city-centre
city_centre..
claiming
class
classed
classic
classics
classier
classified
classy
clentele
client
clientele
clients
climbing
close
close-by
closed
closely
closer
closest
clowns
club
coast
coffee
coffee-shop
coffee_shop.
coffee_shoppe
coffee_shops
coffeehouse
coffees
cold
coloring
combination
combo
come
comensales
comes
comfort
comfortable
coming
commerce
community
company
comparable
compared
comparison
compatibility
competes
competitive
competitively
competitor
competitors
complain
complete
conducive
cones
connected
consider
considerable
considered
considering
considers
consistent
consistently
constant
consumer
consumers
contains
contemporary
contend
continental
continues
convenience
convenient
conveniently
cook
cooked
cooking
cooks
cool
core
corner
cost
cost-friendly
costed
costing
costings
costly
costs
costumer
costumers
could
coupled
couples
course
cousin
coveted
cozy
cracker
craving
cravings
crazy
cream
creating
critics
croissants
crowd
crowds
crumpets
cuisine
cuisines
culinary
cup
curious
current
currently
curry
custom
customer
customer-rated
customer-rating
customers
cut
cute
cuz
d
d'oeuvre
d'oeuvres
daily
date
day
days
deal
deals
dear
decadent
decent
decent-priced
decently
decide
decided
dedicated
deemed
definitely
delectables
delegate
delicacies
delicious
delight
delightful
delights
deliver
deliveries
delivers
delivery
describe
described
deserts
deserves
desired
despite
desserts
destination
detracts
did
diet
different
difficult
din
dine
dine-in
diner
diners
dines
dining
dining..
dinner
dinning
directed
directions
directly
disallows
disappoint
disappointed
disappointing
discerning
discount
discourage
discriminating
dish
dishes
dislocated
dismal
distance
district
dive
do
does
doing
dollar
dollars
done
door
down
downside..
downtown
drain
draw
drink
drinking
drinks
drive
drop
dubbed
due
dull
e
e20
each
ear
early
earned
earning
earns
earth
easily
east
easy
eat
eat-in
eaten
eater
eatery
eatery-
eating
eats
economic
economical
economically
edge
edible
edibles
effective
eggs
either
elegant
elite
emerged
emerging
employees
en
encounter
end
enjoy
enjoyable
enjoyed
enjoying
enjoys
enough
enter
entertain
entertaining
entertainment
entire
entree
entrees
entries
environment
epitome
equal
equally
es
escape
escargot
especially
est
established
establishment
establishments
etc
ethnic
ethos
euro
euros
eve
even
evening
events
ever
every
everybody
everyday
everyone
everything
exactly
example
exceed
exceeding
exceeds
excellence
excellent
excellent-rated
excellently
excels
exceptional
excess
exciting
exclusive
exclusively
excuse
exist
existing
exotic
expansive
expect
expectations
expected
expensive
expensive-priced
experience
experiences
explains
exquisite
extra
extremely
f
f30
fabulous
facilities
facility
fact
fair
fair-price
fair-priced
fair-quality
fairly
fairly-priced
fall
fallen
falling
falls
falsehood
famed
familial
familiar
families
family
family-
family-free
family-oriented
family-style
family-themed
family-unfriendly
family-welcomed
family_friendly..
famous
fancy
fans
fantastic
far
fare
fares
farm
farmers
fast-Food
fast-food
fast-foods
fastfood
favor
favorable
favored
favorite
favorites
favourable
favourite
feast
feature
featured
features
featuring
feed
feedback
feel
feet
few
fewer
ff
fictional
filled
finally
find
finding
fine
fine-dining
finery
finest
finished
first
fish
fishes
fit
fits
five
five-star
fix
flare
flavorful
focus
focused
focuses
foe
follow
fond
fondue
fondues
food
food-type
food.
food..
foods
fool
foot
for
forget
form
fortune
for£20-25
found
founded
four
free
frenziedly
fresh
freshly
fried
friend
friend-family
friending
friendliest
friendly
friendly-friendly
friends
fries
fro
from
front
frugally
fruit
fruits
fry
full
full-service
fun
fun-
furniture
further
fusion
g
gained
gaining
gains
gals
games
garnered
garners
gas
gastro
gastro-pub
gate
gather
gathering
gave
geared
gem
general
generally
generated
generously
get
get-a-way
getaway
gets
getting
give
given
gives
giving
glass
gleaming
glowing
go
god
goddess
goes
going
golden
good
good-quality
good-value
goodies
goods
gorgeous
got
gotten
gourmet
grab
grade
graded
grand
grapes
grate
greasy
great
greater
greatest
greatly
grill
grills
grocery
grommet
groundbreaking
group
groups
grown
grown-up
grub
guarantee
guarantees
guest
guests
gut
guy
gym
h
ha
had
hamburger
hamburgers
hamgurgers
handicap
handy
hang
hankering
happen
happiness
happy
hard
has
hat
have
having
he
head
heads
health
healthy
hear
heard
heart
hearty
hefty
held
hello
help
helps
herbs
here
hi
high-
high-cost
high-end
high-price
high-priced
high-quality
high-ranged
high-rated
high-rating
high-ratings
highchairs
higher
higher-cost
higher-end
higher-priced
higher-than-average
highest
highly
highly-
highly-acclaimed
highly-priced
highly-ranked
highly-rated
highly-recommended
highly-reviewed
hight
highways
hilariously
hires
his
historic
historical
history
hit
hither
hold
holding
holds
hole
home
homemade
honorable
hop
hope
hors
hosts
hot
hotel
hotels
hour
house
houses
how
however
hungry
i
ice
id
idea
ideal
ideally
if
impeccable
implores
importantly
impress
impressive
improve
in
in-house
inappropriate
include
includes
including
incorporates
increasingly
incredible
incredibly
indeed
indicates
individual
individuals
indulge
inexpensive
inexpensively
infamous
infamously
information
ingratiating
ingredients
inside
inspired
instance
instead
int
intended
interested
interesting
intimate
into
introducing
invite
invited
inviting
iron
is
issues
is£20-25
it
item
items
its
itself
join
joint
joints
just
keep
keeping
key
kid
kid-free
kid-friendliness
kiddos
kids
kids-free
kind
kinds
kitchen
know
known
l
l20-15
l20-25
l30
lace
lacking
lackluster
lacks
ladder
lads
laid
lake
landed
landmark
large
larger
last
late
later
latest
launching
law
layout
lays
lbs
leads
least
leave
leaves
leaving
led
lees
legal
lending
lends
less
less-than-£20
less_than_£20-25
less_than_£20-priced
less_than_£20..
less_than_£20.00
less_than_£20.Fitzbillies
lest
let
lets
level
levels
licensed
lie
lies
life
light
likable
like
liked
likely
likes
liking
limited
limits
linguists
liquor
list
listed
little
lively
lives
living
lo
lobster
local
locale
locally
locals
locate
located
locater
locates
locating
location
long
longer
look
looking
looks
lose
lot
lots
love
loved
lovely
lover
lovers
loves
loving
low-
low-average
low-budget
low-cost
low-costs
low-customer-rated
low-end
low-price
low-priced
low-prices
low-proved
low-quality
low-rate
low-rated
low-rating
low-ratings
low-reviewed
low.
lowbrow
lower
lower-priced
lower-than-average
lowest
lowly
lowly-ranked
luck
lunch
lunches
luxuriant
luxurious
luxury
made
main
mainly
mainstream
maintains
major
make
makes
making
man
manageable
manner
many
map
mare
margin
mark
marked
market
marketplace
marks
match
matches
matter
mature
maximal
maximum
may
maybe
me
meal
meals
means
meant
meat
median
mediocre
medium
medium-high
medium-price
medium-priced
medium-quality
medium-range
meet
meetings
member
members
mention
menu
menus
mere
merely
merits
mid
mid-cost
mid-level
mid-price
mid-priced
mid-prices
mid-range
mid-ranged
mid-rated
middle
middle-priced
middle-ranged
middling
might
mildly
mile
miles
milkshakes
mimic
mind
minded
minimum
minors
minutes
misguided
miss
mistaken
mix
mixed
moder
moderate-
moderate-price
moderate-priced
moderated
moderately
moderately-priced
moderately-rated
moderates
modern
modernly
modest
modestly
moire
mom
moment
money
mood
more
more_than_£30-priced
more_than_£30.00
more_than_£30and
most
mostly
mot
mothers
mouth
moved
much
multicultural
munch
must
my
n
n't
name
named
names
native
nature
near
nearby
neat
need
needs
negative
neighbor
neighborhood
neighboring
neighbour
neighbourhood
nested
nestled
nests
nevertheless
new
newly-opened
next
nice
nicely
nicer
night
nightlife
nights
no
noise
noises
non
non-
non-familiar
non-family
non-family_friendly
non-friendly
none
noodle
noodles
nor
normal
normal-priced
normally
north
northeast
northern
northwest
northwestern
not
not-for-kids
notch
note
noted
nothing
nourishment
now
nowhere
number
o
obscene
obtained
obviously
occasion
odd
odious
of
off
offer
offered
offering
offerings
offers
often
of£
of£20-25
of£20-£30
ok
okay
old
older
olive
olives
on
one
one-star
one-starred
online
only
open
opened
opening
operate
opinion
opinions
opportunity
opposite
option
optional
options
or
or5
order
ordered
orders
ordinary
ore
oregano
organization
organizations
oriental
oriental-style
orientated
oriented
other
others
our
out
outer
outing
outlet
outside
outskirts
outstanding
over
over-
over-all
over-looking
over-priced
overall
overlooking
overlooks
overly
overpriced
overs
over£30
ow
own
owner
pairing
pairings
palace
palate
palates
par
parents
parings
park
parking
part
partake
particular
particularly
parties
partner
pass
passing
past
pasta
pastas
pastries
path
patrons
pay
paying
peace
peaceful
penny
people
per
perfect
perfectly
performing
perhaps
perks
permit
permits
permitted
person
personal
pick
picnic
picturesque
pint
pit
pizza
place
placed
places
plan
plans
plate
plates
platters
play
playground
playgrounds
pleasant
please
pleased
pleasing
plus
pocket
point
pointer
points
policy
polite
ponds
poor
poor-rated
poorly
poorly-rated
poorly-reviewed
pop
popped
popular
popularity
population
position
positive
possesses
possible
potato
pound
pounds
praised
prams
prance
precisely
predominantly
prefer
preferred
premises
premium
prepare
prepared
prepares
present
presently
presents
prestige
prestigious
pretty
previous
price
price-range
priced
prices
pricey
pricier
pricing
pried
primarily
prime
prince
priority
private
prizes
problem
produces
product
products
professionally
profile
profits
prohibited
promises
prompt
property
proud
proudly
prove
proves
provide
provided
provider
providers
provides
providing
proximity
pub-style
pub-type
public
pubs
pug
pump
pun
pup
purchase
purchased
purely
purpose
purveyor
put
quadrant
quaint
qualification
qualified
quality
questionable
quick
quickly
quid
quiet
quinine
quite
rage
ran
ranch
rand
rang
range
ranged
ranger
ranges
ranging
rank
ranked
ranking
ranks
rant
ranting
rare
raring
rate
rated
rater
rates
rather
rating
rating-
rating.
rating..
rating3_out_of_5
ratings
ratings..
ration
ratting
rave
raving
reach
reaching
ready
real
really
rear
reason
reasonable
reasonably
reasonably-priced
reasons
receive
received
receives
receiving
recent
recently
recommenced
recommend
recommendation
recommended
recommending
red
reduced
refine
reflect
reflection
refreshment
refreshments
regarded
region
regret
regular
regularly
rejects
relative
relatively
relax
relaxed
relaxing
relocating
remaining
remains
remarkable
remember
reminded
report
reported
reports
reputation
requirements
requires
reserve
reserving
reside
residents
resides
respectable
respected
respite
response
rest
restaurant-setting
restaurantr
restaurants
restroom
restrooms
rests
result
resulting
results
review
reviewed
reviewers
reviews
revived
rice
rich
richer
riddle
ride
ridiculously
right
ring
rival
rive
river
river-side
riverbank
riverfront
rivers
riverside-area
riverside-situated
riverside-view
road
roast
role
rolls
romantic
rood
roughly
round
rub
rude
ruin
run
running
runs
s
sacrifice
sadly
safe
said
sale
sales
same
sample
samples
sat
satisfaction
satisfactory
satisfied
satisfying
sausage
sausages
savory
say
says
scale
scare
scared
scene
scenery
scenic
school
scintillating
score
scored
scores
scoring
scroll
scrum
scummy
sea
sea-food
seafare
seafood
search
searching
sears
second
section
see
seek
seeking
seem
seems
seen
select
selection
selections
sell
selling
sells
selves
sensible
sensibly
sered
serve
served
server
servers
serves
service
services
servicing
serving
servings
set
setting
settings
setup
seven
several
severs
shabby
share
sheep
ship
shitty
shoo
shop
shopping
shops
shores
short
shot
should
shout
show
shown
shows
shrimp
shut
side
similar
simple
simply
simultaneously
since
single
singles
singletons
sis
sit
sit-down
site
sited
sits
sitting
situated
six
size
sized
sizes
skirts
slap
slice
slight
slightly
slow
small
smart
snacks
snugly
so
so-so
socialize
soda
sodas
soft
softens
sold
solid
solo
solstice
some
something
somewhat
somewhere
soon
sophisticated
sorry
sort
sorts
soup
soups
south
southern
southpawn
space
spacious
spaghetti
speak
speaking
special
specialises
specialising
specialist
specialized
specializes
specializing
specials
specialties
specialty
specific
specifically
spectacular
spectrum
spend
spenders
spending
spendy
spent
spirits
spite
spoon
sporting
sports
spot
staff
stake
standard
standards
standing
stands
star
starred
starring
stars
start
started
starting
starts
stat
stationed
status
stay
stay-cation
staying
steadily
steak
steal
steep
steeply
stellar
steps
sterling
sticks
still
stomach
stone
stop
stopping
store
straight
strategically
street
striking
strollers
strolling
students
stuff
stunning
style
styled
styling
sub
sub-par
substandard
succulent
such
suffered
suffers
suggest
suggests
suit
suitable
suitably
suited
summer
sun
super
super-
superb
superior
suppliers
supplies
support
supported
sure
surely
surpass
surprise
surprising
surprisingly
surrounding
surroundings
surveillance
sushi
sushi-serving
sustenance
swanky
switched
syndrome
t
tab
table
tad
tag
tailors
take
take-
take-away
take-in
take-out
take-outs
takeaway
takeout
takes
taking
tale
tall
tapa
tapas
target
taste
tastes
tasting
tastings
tasty
tat
tea
tell
tempting
ten
tend
tends
terrible
terrific
th
than
than£20
than£30
that
thats
the
thee
their
them
theme
themed
then
then£20
there
therefore
theres
these
thew
they
thing
things
think
thinking
thirsty
thirty
this
those
though
thought
three
three-star
three-starred
three-stars
through
throw
thrown
thumbs
ti
tied
tier
tight
time
times
to
to5
toast
today
together
toilets
too
top
top-customer
top-rated
touring
tourist
tourists
touts
tow
toward
towards
town
toy
toys
tradition
traditional
traditionally
transport
travel
traveling
treat
treats
tree
trendy
trip
trouble
true
truly
try
trying
turn
twenty
twenty-five
two
type
types
typical
typically
u
ultimate
unable
unbelievable
under
underneath
underrated
unexpected
unexplained
unfamiliar
unfavourable
unfortunately
unfriendly
unique
university
unmissable
unpopular
unrecommended
unsatisfactory
unsuitable
unsurpassed
unwelcoming
up
updated
upmarket
upper
upper-end
upscale
upward
upwards
urban
us
use
useful
user
usual
usually
valuable
value
values
varied
varies
varieties
variety
various
vary
varying
vast
vendor
venue
venues
very
via
viable
vibe
vicinity
view
view..
viewed
views
vino
visit
visited
visiting
visitor
visitors
waiting
wakey
walk
walking
wall
wallet
want
wanted
wanting
wants
wares
warm
warn
warning
warrant
was
washed
watch
watching
water
waterfront
watering
waters
waterside
way
we
wealthy
weary
websites
welcome
welcomed
welcomes
welcoming
well
well-known
well-priced
well-rated
well-received
well-recognized
well-respected
well-reviewed
wells
went
were
west
western
what
whee
when
where
whet
whether
which
while
whine
whit
who
whole
whose
why
wide
will
willing
wine
winery
wines
winner
winning
wise
wish
wit
witch
with
within
without
wo
wonder
wonderful
wont
work
worker
working
worry
worse
worth
worthed
worthy
would
wrestling
wrong
y
year
yes
yet
yo
you
young
your
yourself
zesty
zone
£
£0
£10
£10.50
£19.99
£20
£20-
£20-2
£20-25.Yes
£20-26
£20-50
£20-£25
£20-£30
£20..
£20.00
£22
£24
£25
£25-25
£25.00
£30
£30.00
£32
£35
£3o
£8
£9.50
£and
!
'
'd
'll
'low
'm
're
's
've
+
,
-
--
-25
-family_friendly
-food
-friendly
-price
-priced
-rated
-star
-£25
.
..
...
.Nice
.No
.Or
.Price
.The
.average
.children
.customer
1
1-5
1-Star
1-star
130
1out5
2
20
20-25
20-25.
20-25L
20-25and
20-25euros
20-25lb
20-25pounds
20-25£
20-50
20.
20.00
20GBP
20L
20lb
20s
20£
20£-30£
21
23
24-hour
25
25lb
25£
3
3-5
3-out
3-out-of-5
3-star
3-stars
3.33
3.5
3/5
30
30.
30.£
30Euro
30GBP
30L
30lb
30pounds
30£
3_out_of_5Located
3_out_of_5The_Rice_Boat
3of5
3out
4
4.5
4.5_out_of_5
40
5
5-5
5-Star
5-out-of-5
5-star
5-stars
5.
5_out_of_5..
5_out_of_5customer
5of5
5of5located
5out
5star
6
:
;
?
